"""
输出 文字 到文件

1.print方法
2.文件读写方式
"""
import math

fp = open("demo1.txt", "w")
print("print txt to file", file=fp)
fp.close()


"""
输出天气预报

"""

print("{0:^6}{1:^4}".format("星期日", "today"))
print("---------------------------------------")
print("{0:^4}{1:^4}{2:^4}{3:^4}{4:^4}{5:^4}".format("08时", "11时", "14时", "17时", "20时", "23时"))
print("{0:^4}{1:^4}{2:^4}{3:^4}{4:^4}{5:^4}".format("0℃", "11℃", "14℃", "17℃", "20℃", "23℃"))
print("---------------------------------------")


"""
输出颜色文字

对应的一些属性
https://blog.csdn.net/weixin_45694843/article/details/124222543
"""

print("\033[0:35m---------------\033[m")
print("{:0.2f}".format(math.pi))
